<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1667c8d280599c07b2af643dc437a0df79e1240454f7e5aab8d208111183ee25","plan_job_ref":"Job Run Terraform plan in staging #187 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13436673619","plan_out_hash":"c4f4b3cd8b17c59edc3f61ceabb087efeb278db867268d8e8a70781222d0cbc3","plan_hash":"26a06d0b3e7943f8862b8d8835b10b10fb3ba7172abc501fe8bd6a6557d16908","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "SAXjqM+hG9pRil77zkKX1xSuWaMjSeiN9vf8f9msqnk=" -> "vQ39e6KsumA1DBr2LpwgbZ72aV78pto2s1NndZir2lU="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-02-18T14:26:51Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #187](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13436673619)